<template>
  <q-layout view="lhr lpr lfr">
    <q-page class="flex flex-center">
      <q-card>
        <q-tabs
          v-model="tab"
          class="text-grey"
          active-color="primary"
          indicator-color="primary"
          align="center"
        >
          <q-tab name="about" label="О проекте" />
          <q-tab name="task" label="Задание" />
          <q-tab name="help" label="Справка" />
        </q-tabs>

        <q-separator />

        <q-tab-panels
          v-model="tab"
          animated
          transition-prev="jump-up"
          transition-next="jump-up"
        >
          <q-tab-panel name="about">
            <div class="gutter-sm" id="page">
              <p class="text">
                Выполнил курсовой проект по дисциплине "Безопасность систем баз
                данных"
              </p>
              <p class="text">студент группы 641 Чесалин И.Е.</p>
              <p class="text">
                проверила старший преподаватель кафедры "Информационная
                безопасность" Калинкина Т.И.
              </p>
            </div>
          </q-tab-panel>

          <q-tab-panel name="task">
            <div class="gutter-sm" id="page">
              <p class="text">
                Тема курсового проекта: разработка подсистемы администрирования
                информационной системы «Умный дом»
              </p>

              <p class="text-h6">
                Задание:
              </p>

              <p>
                1. Провести анализ предметной области: назначение, область
                применения, функции, выполняемые системой;
              </p>

              <p>
                2. Разработать базу данных для выбранной информационной системы:
              </p>
              <p>
                - провести анализ объекта информатизации;
              </p>
              <p>
                - выбрать сущности;
              </p>
              <p>
                - разработать таблицы базы данных и определить связи между ними;
              </p>
              <p>
                - построить ER-диаграмму;
              </p>
              <p>
                - провести нормализацию базы данных;
              </p>

              <p>
                3. Разработать ограничения, накладываемые на пользователей ИС
                различных типов. Предусмотреть наличие пользователей следующих
                типов:
              </p>
              <p>
                - администратор ИС;
              </p>
              <p>
                - оператор;
              </p>
              <p>
                - привилегированной пользователь;
              </p>
              <p>
                - непривилегированный пользователь;
              </p>

              <p>
                4. Разработать скрипт, позволяющих добавить необходимых
                пользователей в систему;
              </p>

              <p>
                5. Разработать перечень пользователей и определить их права в
                системе.
              </p>

              <p>
                6. Разработать таблицу соответствия пользователей и прав,
                которые им предоставлены;
              </p>

              <p>
                7. Разработать скрипт, реализующий п.3, а также создающий
                необходимые объекты БД, связывающий пользователей и объекты БД;
              </p>

              <p>
                8. Разработать скрипт модификации БД с целью реализации
                выбранной политики разграничения доступа;
              </p>

              <p>
                9. Наполнить БД адекватными данными, позволяющими проверить
                функционирование модели разграничения доступа. Разработать
                соответствующие скрипты;
              </p>

              <p>
                10. Разработать демонстрационные запросы для проверки прав
                доступа в системе.
              </p>
            </div>
          </q-tab-panel>

          <q-tab-panel name="help">
            <div class="gutter-sm" id="page">
              <p>
                Данное программное обеспечение позволяет управлять устройствами
                интернета вещей с помощью единого Web-интерфейса, который далее
                будем называть интерфейсом умного дома, доступ к которому
                пользователь может получить из любой точки мира.
              </p>

              <p>
                С помощью него пользователь может включать и выключать
                устройства, менять их параметры, наблюдать в реальном времени
                показатели сенсоров, добавлять и удалять устройства из базы
                данных.
              </p>
            </div>
          </q-tab-panel>
        </q-tab-panels>
      </q-card>
    </q-page>
  </q-layout>
</template>

<script>
export default {
  name: "AboutPage",
  data() {
    return {
      tab: "about"
    };
  }
};
</script>

<style>
.text {
  font-size: 1.2em;
  text-align: center;
}

#page {
  width: 900px;
  max-width: 90vw;
}
</style>
